In [2]:
def copper_data_store():
    print("connection establishment")
    print("data transfer for copper")
    print("connection Termination")
def silver_data_store():
    print("connection establishment")
    print("data transfer for silver")
    print("connection Termination")
def gold_data_store():
    print("connection establishment")
    print("data transfer for gold")
    print("connection Termination")

In [3]:
copper_data_store()
silver_data_store()
gold_data_store()

connection establishment
data transfer for copper
connection Termination
connection establishment
data transfer for silver
connection Termination
connection establishment
data transfer for gold
connection Termination

In [4]:
def db_connection(funct):
    def inner():
        print("connection establishment")
        funct()
        print("connection termination")
    return inner

In [6]:
@db_connection
def copper_data_store():   
    print("data transfer for copper")
@db_connection 
def silver_data_store():
    print("data transfer for silver")
@db_connection
def gold_data_store():   
    print("data transfer for gold")

In [7]:
copper_data_store()
silver_data_store()
gold_data_store()

connection establishment
data transfer for copper
connection termination
connection establishment
data transfer for silver
connection termination
connection establishment
data transfer for gold
connection termination

In [15]:
def auth_decor(funct):
    def inner():
        u = 'admin'
        username = input("Enter the username:")
        if u==username:
            p = 'admin@123'
            password = input("Enter the Password:")
            if p==password:
                print("logged in....")
                funct()
                print("logged out...")
            else:
                print("wrong password")
        else:
            print("wrong username")
    return inner
@auth_decor
def fetch_account_bal():
    a = 54356345
    print("Your acc bal is:",a)

In [16]:
fetch_account_bal()

Enter the username: admin
Enter the Password: sadfsdfsdaf

wrong password

In [17]:
@auth_decor
def test():
    print("Hello")

In [18]:
test()

Enter the username: admin
Enter the Password: admin@123

logged in....
Hello
logged out...

In [ ]:
code Optimization Technique-Part-1
==================================

In [20]:
(lambda x : x.split('@')[0])('test@gmail.com')

'test'

In [21]:
p = [1,2,3,4,5,6]

In [22]:
sqr =  []
for i in p:
    sqr.append(i**2)
print(sqr)

[1, 4, 9, 16, 25, 36]

In [23]:
def sqr_element(element):
    return element**2

In [24]:
list(map(sqr_element,p))

[1, 4, 9, 16, 25, 36]

In [25]:
list(map(lambda x: x**2,p))

[1, 4, 9, 16, 25, 36]

In [26]:
emails = ['test@gmail.com','sample@gmail.com','python@yahoo.com','ml@redffimail.com']

In [29]:
tuple(map(lambda x: x.split('@')[0],emails))

('test', 'sample', 'python', 'ml')

In [30]:
emp = {'id':[1,2,3],
       "name":['rahul patil','amit sharma','sonali mante'],
       'sal':[54454,3434,6454]}

In [31]:
import pandas as pd

In [32]:
df = pd.DataFrame(emp)

In [33]:
df

   id          name    sal
0   1   rahul patil  54454
1   2   amit sharma   3434
2   3  sonali mante   6454

In [34]:
df['fname'] = df['name'].map(lambda x: x.split()[0])

In [35]:
df

   id          name    sal   fname
0   1   rahul patil  54454   rahul
1   2   amit sharma   3434    amit
2   3  sonali mante   6454  sonali

In [36]:
df['lname'] = df['name'].map(lambda x: x.split()[1])

In [37]:
df

   id          name    sal   fname   lname
0   1   rahul patil  54454   rahul   patil
1   2   amit sharma   3434    amit  sharma
2   3  sonali mante   6454  sonali   mante

In [38]:
df['fname']= df['fname'].map(lambda x: x.capitalize())

In [39]:
df

   id          name    sal   fname   lname
0   1   rahul patil  54454   Rahul   patil
1   2   amit sharma   3434    Amit  sharma
2   3  sonali mante   6454  Sonali   mante

In [40]:
gen = ['m','f','m','f','f','f']